//  --------------------------    8 kuy
// 1 -- 1 СТРОКА -- ВОЗВРАЩАЕТ ПРИВЕТСТВИЕ НА НУЖНОМ ЯЗЫКЕ
// 2 -- 56 СТРОКА -- ВОЗВРАЩАЕТ ДЕНЬ НЕДЕЛИ В СООТВЕТСТВИИ С ВВЕДЕНЫМ ЧИСЛОМ
// 3 -- 91 СТРОКА -- ДЕПЕСТКИ РОЗ. НЕЧЕТ - TRUE, ЧЁТ - FALSE
// 4 -- 107 СТРОКА -- ОСТАТОК ОТ ДЕЛЕНИЯ (ЯВЛЯЕТСЯ ЛИ ОДНО ЧИСЛО ФАКТОРОМ ДРУГОГО)
// 5 -- 137 СТРОКА -- КЛЕТКА. СПЕРМА. ГЕНЕТИКА -- ИЩЕМ ГЕН Y
// 6 -- 153 СТРОКА -- В ЗАВИСИМОСТИ ОТ ЧИСЛА - НАПРИМЕР 3 - ВОЗРАЩАЕМ : 1 ОВЦА, 2 ОВЦА, 3 ОВЦА.
// 7 -- 165 СТРОКА -- возвращаЕМ true, если первый переданный аргумент (строка) заканчивается вторым аргументом (тоже строкой).
// 8 -- 178 СТРОКА -- БОЛЬШИЕ БУКВЫ В МАЛЕНЬКИЕ И НАОБОРОТ В СТРОКЕ
// 9 -- 193 СТРОКа --  НАЙТИ МИНИМАЛЬНОЕ ЧИСЛО В МАССИВЕ
// 10 -- 218 Строка -- перемножить все числа в массиве
// 11 -- 241 строка -- простой ПАЛИНДРОМ - сторока со словом
//
//
//--------------------------       7 kuy
// #
// 1 -- 1 СТРОКА -- СТРОКА ИЗ БУКВ НАПРИМЕР 5. НУЖНО: - ПЕРВАЯ ОДНА, ВТОРЫХ 2, ТРЕТИХ 3 И ТД. КАЖДАЯ ПЕРВАЯ БОЛЬШАЯ, ЧЕРЕЗ ДЕФИС.
// 2 -- 30 СТРОКА -- список неотрицательных целых чисел и строк и возвращает новый список с отфильтрованными строками. (БЕЗ СТРОК)
// 3 -- 46 СТРОКА -- ВОЗВРАЩАЕТ ЧИСЛА В ПОРЯДКЕ УБЫВАНИЯ
// 4 -- 58 СТРОКА -- ВОЗВРАЩАЕТ ИМЕНА ИЗ 4Х БУКВ
// 5 -- 67 строка -- БЕРЕТ 2 СТРОКИ, ВОЗВРАЩАЕТ ОДНУ ОТСОРТИРОВАНИУ С УНИКАЛЬНЫМИ БУКВАМИ В АЛФАВИТНОМ ПОРЯДКЕ
// 6 -- 84 СТРОКА -- ВОЗВРАЩАЕТ TRUE ЕСЛИ В СТРОКЕ ТОЛЬКО УНИКАЛЬНЫЕ БУКВЫ (НЕ ПОВТОРЯЮТСЯ) И FALSE ЕСЛИ ПОВТОРЯЮТСЯ
// 7 -- 105 СТРОКА -- BUBBLESORT - сравнение предыдущего элемента с последующим и сортируем от мленького к большому.
// 8 -- 146 СТРОКА -- выбираем 2 самых маленьких числа из массива
// 9 -- 167 СТРОКА -- ВЫБИРАЕМ НУЖНЫЕ ГЛАСТНЫЕ ИЗ СТРОКИ
// 10 -- 199 СТРОКА -- ПРИВОДИМ К БИНАРНОМУ ЧИСЛУ
// 11 -- 210 СТРОКА -- ИЩЕМ Х И О
// 12 -- 288 СТРОКА -- ЕСТЬ МАСИВ ['A','B','C'] - ВЕРНУТЬ ['1: A', '2: B', '3: C']
// 13 -- 303 строка -- в массиве много массивой - возраст и хендикап - senior или open
// 14 -- 333 строка --  является ли число квадратным - math.sqrt - определяет корень (2*2, 5*5)
// 15 -- 357 строка -- триугольник нечетных чисел - возведение в степень.
//




// --------------------------------   6 kuy
//
// 1 -- 1 СТРОКА -- 70506 - вренуть строку 70000+500+6
// 2 -- 59 СТРОКА -- БАШНЯ ИЗ ЗВЕЗД (ЁЛОЧКА)
// 3 -- 83 строка -- СУПЕРМАРКЕТ, КАССЫ, ОЧЕРЕДЬ - СКОЛЬКО ВРЕМЕНИ НУЖНО ЧТОБЫ ВСЕХ ОБСЛУЖИТЬ.
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
