// 1 - 172  СТРОКи -- автопроверка - задачи
// 173  СТРОКА -- Callback - 2 примера
// 207  СТРОКА -- JS - queryselector, firstElementChild, classList.add, classList.toggle, .textContent, document.createElement, appendChild
// 222  СТРОКА -- for \ for of
// 241  СТРОКА -- pop, shift, unshift, splice, join
// 259  СТРОКА -- Math.min и max
// 263  СТРОКА -- какаето мутная задача - не вспомнил, не разбирался
// 297  СТРОКА -- задача из кодварс
// 315  СТРОКА -- уменьшеная копия строки 837 (sort)
// 325  СТРОКА -- new Date (без библиотеки)
// 354  СТРОКА -- setTimeOut
// 372  СТРОКА -- fetch
// 384  СТРОКА -- Callback (по модулю 4)
// 410  СТРОКА -- Чуток по this
// 426  СТРОКА -- Прототипное наследование
// 446  СТРОКА -- Функция конструктор
// 489  СТРОКА -- Промисы, 2 варианта записи
// 518  СТРОКА -- вычисляемые свойства (когда не знаем что нам прийдет с сервера)
// 528  СТРОКА -- задача из кодварс
// 561 СТРОКА -- spread или Object.assign или (_.clone) из lodash
// 585 СТРОКА -- урок 3 (filter, map, reduce, split, join ; debugger ; тернарник)
// 633 СТРОКА -- spread - нюансы
// 657 СТРОКА -- урок 4.1 - замыкание (пример Репеты)
// 670 СТРОКА -- деструктуризация
// 689 СТРОКА -- итератор (асинхронный перебор коллекции)
// 711 СТРОКА -- 5.1 по репете (this , call, apply, bind)
// 778 СТРОКА -- craking JS 2.3 (map, set ; Нюансы привода к строке к числу ; собственная ф-я конструктор - для многоразового использования)
// 837 СТРОКА -- craking JS 4.2 (sort, slice, flat, ENTERIES)
// 876 СТРОКА -- craking JS 5.1-5.3 задача для собеседования с сеттаймаутом - что сдесь не так ?
// 908 СТРОКА -- craking JS 8 (тесты кахута: || и &&, bolean и !!, arguments, контекст this)
// 985 строка -- вехний регистр к нижнему и нижний к верхнему
// 1004 строка -- ЗАМЫКАНИЕ
